swang-wyze/AmebaPro2_SDK_v9.0a/component/soc/8735b/fwlib/rtl8735b/lib/source/rom/rtl8735b_timer.c
/**************************************************************************//**
 * @file     rtl8195bhp_timer.c
 * @brief    This file implements the HW Timer HAL functions.
 *
 * @version  V1.00
 * @date     2020-11-12
 *
 * @note
 *
 ******************************************************************************
 *
 * Copyright(c) 2007 - 2016 Realtek Corporation. All rights reserved.
 *
 * SPDX-License-Identifier: Apache-2.0
 *
 * Licensed under the Apache License, Version 2.0 (the License); you may
 * not use this file except in compliance with the License.
 * You may obtain a copy of the License at
 *
 * http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an AS IS BASIS, WITHOUT
 * WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
 * See the License for the specific language governing permissions and
 * limitations under the License.
 *
 ******************************************************************************/

#include "cmsis.h"
#include "rtl8735b_tg_type.h"
#include "rtl8735b_tm_type.h"
//#include "hal_platform_rtl8735b.h"


#if CONFIG_GTIMER_EN

#define SECTION_GTIMER_TEXT           SECTION(".rom.hal_timer.text")
#define SECTION_GTIMET_DATA           SECTION(".rom.hal_timer.data")
#define SECTION_GTIMER_RODATA         SECTION(".rom.hal_timer.rodata")
#define SECTION_GTIMERBA_RODATA       SECTION(".rom.hal_timer_ba.rodata")
#define SECTION_GTIMER_BSS            SECTION(".rom.hal_timer.bss")
#define SECTION_GTIMER_STUBS          SECTION(".rom.hal_timer.stubs")

#define GTIMER_REG_SIZE               0x40


extern void *_memset(void *dst0, int Val, size_t length);

/**
 * @addtogroup hs_hal_timer TIMER
 * @{
 */

extern phal_timer_adapter_t psystem_timer;


#if !defined(CONFIG_BUILD_NONSECURE)
#undef TIMER_GROUP0_REG_BASE
#define TIMER_GROUP0_REG_BASE (TG0_S_BASE)
#undef TIMER_GROUP1_REG_BASE
#define TIMER_GROUP1_REG_BASE (TG1_S_BASE)
#undef TIMER_GROUP2_REG_BASE
#define TIMER_GROUP2_REG_BASE (TG2_S_BASE)
#undef TIMER_GROUP3_REG_BASE
#define TIMER_GROUP3_REG_BASE (TG3_S_BASE)
#else

#undef TIMER_GROUP0_REG_BASE
#define TIMER_GROUP0_REG_BASE (TG0_BASE)
#undef TIMER_GROUP1_REG_BASE
#define TIMER_GROUP1_REG_BASE (TG1_BASE)
#undef TIMER_GROUP2_REG_BASE
#define TIMER_GROUP2_REG_BASE (TG2_BASE)
#undef TIMER_GROUP3_REG_BASE
#define TIMER_GROUP3_REG_BASE (TG3_BASE)

#endif

#if !defined(CONFIG_BUILD_NONSECURE)
#undef TM0_REG_BASE
#define TM0_REG_BASE (TM0_S)
#undef TM1_REG_BASE
#define TM1_REG_BASE (TM1_S)
#undef TM2_REG_BASE
#define TM2_REG_BASE (TM2_S)
#undef TM3_REG_BASE
#define TM3_REG_BASE (TM3_S)
#undef TM4_REG_BASE
#define TM4_REG_BASE (TM4_S)
#undef TM5_REG_BASE
#define TM5_REG_BASE (TM5_S)
#undef TM6_REG_BASE
#define TM6_REG_BASE (TM6_S)
#undef TM7_REG_BASE
#define TM7_REG_BASE (TM7_S)
#undef TM8_REG_BASE
#define TM8_REG_BASE (TM8_S)
#undef TM9_REG_BASE
#define TM9_REG_BASE (TM9_S)
#undef TM10_REG_BASE
#define TM10_REG_BASE (TM10_S)
#undef TM11_REG_BASE
#define TM11_REG_BASE (TM11_S)
#undef TM12_REG_BASE
#define TM12_REG_BASE (TM12_S)
#undef TM13_REG_BASE
#define TM13_REG_BASE (TM13_S)
#undef TM14_REG_BASE
#define TM14_REG_BASE (TM14_S)
#undef TM15_REG_BASE
#define TM15_REG_BASE (TM15_S)
#undef TM16_REG_BASE
#define TM16_REG_BASE (TM16_S)
#undef TM17_REG_BASE
#define TM17_REG_BASE (TM17_S)


#else
#undef TM0_REG_BASE
#define TM0_REG_BASE (TM0)
#undef TM1_REG_BASE
#define TM1_REG_BASE (TM1)
#undef TM2_REG_BASE
#define TM2_REG_BASE (TM2)
#undef TM3_REG_BASE
#define TM3_REG_BASE (TM3)
#undef TM4_REG_BASE
#define TM4_REG_BASE (TM4)
#undef TM5_REG_BASE
#define TM5_REG_BASE (TM5)
#undef TM6_REG_BASE
#define TM6_REG_BASE (TM6)
#undef TM7_REG_BASE
#define TM7_REG_BASE (TM7)
#undef TM8_REG_BASE
#define TM8_REG_BASE (TM8)
#undef TM9_REG_BASE
#define TM9_REG_BASE (TM9)
#undef TM10_REG_BASE
#define TM10_REG_BASE (TM10)
#undef TM11_REG_BASE
#define TM11_REG_BASE (TM11)
#undef TM12_REG_BASE
#define TM12_REG_BASE (TM12)
#undef TM13_REG_BASE
#define TM13_REG_BASE (TM13)
#undef TM14_REG_BASE
#define TM14_REG_BASE (TM14)
#undef TM15_REG_BASE
#define TM15_REG_BASE (TM15)
#undef TM16_REG_BASE
#define TM16_REG_BASE (TM16)
#undef TM17_REG_BASE
#define TM17_REG_BASE (TM17)


#endif



/**
    - timer group 0
    00:32KHz(S1)
    01:IRC_4MHz(ANA_CLK)
    10:PERI_PLL_40MHz
    - Other timer group
    00: 32kHz
    01: 4MHz
    10: 31.25MHz
 */
SECTION_GTIMER_RODATA
const u32 gtimer_sclk_freq[4] = {
	(u32)32000,
	(u32)4000000,
	(u32)40000000,
	(u32)31250000
};

/**
  * @brief minimum tick time(after pre-scaler) in ns for each SCLK.
  */
SECTION_GTIMER_RODATA
const u32 gtimer_min_tick[4] = {
	(u32)31250,
	(u32)250,
	(u32)25,
	(u32)32
};

/**
  * @brief maximum tick time(after pre-scaler) in ns for each SCLK.
  */
SECTION_GTIMER_RODATA
const u32 gtimer_max_tick[4] = {
	(u32)31250000,
	(u32)250000,
	(u32)25000,
	(u32)32000
};


/**
  * @brief The table of all Gtimer tick count.
  */
SECTION_GTIMER_RODATA
const u32 gtimer_sclk_tick_cnt_125ms[4] = {
	(2000000 / 8),
	(20000000 / 8),
	(32000 / 8),
	(32768 / 8)
};

/**
  * @brief The table of all TIMER ID.
  */
SECTION_GTIMER_RODATA
const timer_id_t pwm_avail_timer_list[] = {
	GTimer1,  GTimer2,	GTimer3,  GTimer4,
	GTimer5,   GTimer6,   GTimer7,	GTimer0,
	GTimer9,   GTimer10,  GTimer11, GTimer12,
	GTimer13,  GTimer14,  GTimer15,
	0xFF   /* end of list */
};



/**
  * @brief The table of all TIMER registers base address.
  */
//SECTION_GTIMERBA_RODATA
//const TM_TypeDef *timer_base_address[MaxGTimerNum] = {
//     TM0,  TM1,  TM2,  TM3,
//     TM4,  TM5,  TM6,  TM7,
//     TM9,  TM10, TM11, TM12,
//     TM13, TM14, TM15, TM16};


SECTION_GTIMERBA_RODATA
const TM_TypeDef *timer_base_address[MaxGTimerNum] = {
	TM0_REG_BASE,  TM1_REG_BASE,  TM2_REG_BASE,  TM3_REG_BASE,
	TM4_REG_BASE,  TM5_REG_BASE,  TM6_REG_BASE,  TM7_REG_BASE,
	TM9_REG_BASE,  TM10_REG_BASE, TM11_REG_BASE, TM12_REG_BASE,
	TM13_REG_BASE, TM14_REG_BASE, TM15_REG_BASE, TM16_REG_BASE
};





/**
  * @brief The global data structure to handle common resource
  *        for all TIMER group0 adapters.
  */
SECTION_GTIMER_BSS hal_timer_group_adapter_t *ptimer_group0;

/**
  * @brief The global data structure to handle common resource
  *        for all TIMER group1 adapters.
  */
SECTION_GTIMER_BSS hal_timer_group_adapter_t *ptimer_group1;

/**
  * @brief The global data structure to handle common resource
  *        for all TIMER group2 adapters.
  */
SECTION_GTIMER_BSS hal_timer_group_adapter_t *ptimer_group2;

/**
  * @brief The global data structure to handle common resource
  *        for all TIMER group3 adapters.
  */
SECTION_GTIMER_BSS hal_timer_group_adapter_t *ptimer_group3;



/// @cond DOXYGEN_ROM_HAL_API

/**
 * @addtogroup hs_hal_timer_rom_func TIMER HAL ROM APIs.
 * @ingroup hs_hal_timer
 * @{
 * @brief The TIMER HAL ROM APIs. The user application(in RAM space) should not call these APIs directly.
 *        There is another set of TIMER HAL APIs in the RAM space is provided for the user application.
 */

/**
  \brief  The stubs functions table of the TIMER HAL functions in ROM.
*/
SECTION_GTIMER_STUBS const hal_timer_func_stubs_t hal_gtimer_stubs = {
	.pptimer_group0 = &ptimer_group0,
	.pptimer_group1 = &ptimer_group1,
	.pptimer_group2 = &ptimer_group2,
	.pptimer_group3 = &ptimer_group3,
	.hal_timer_convert_ticks_to_us = hal_rtl_timer_convert_ticks_to_us,
	.hal_timer_convert_us_to_ticks = hal_rtl_timer_convert_us_to_ticks,
	.hal_timer_convert_ticks_to_us64 = hal_rtl_timer_convert_ticks_to_us64,
	.hal_timer_convert_us_to_ticks64 = hal_rtl_timer_convert_us_to_ticks64,
	.hal_timer_irq_handler = hal_rtl_timer_irq_handler,
	.hal_timer_me_ctrl = hal_rtl_timer_me_ctrl,
	.hal_timer_set_me_counter = hal_rtl_timer_set_me_counter,
	.hal_timer_group_en_ctrl = hal_rtl_timer_group_en_ctrl,
	.hal_timer_group_pclk_ctrl = hal_rtl_timer_group_pclk_ctrl,
	.hal_timer_group_sclk_ctrl = hal_rtl_timer_group_sclk_ctrl,
	.hal_timer_group_intclk_sel = hal_rtl_timer_group_intclk_sel,
	.hal_timer_group_init = hal_rtl_timer_group_init,
	.hal_timer_group_deinit = hal_rtl_timer_group_deinit,
	.hal_timer_bare_init = hal_rtl_timer_bare_init,
	.hal_timer_deinit = hal_rtl_timer_deinit,
	.hal_timer_group_reg_irq = hal_rtl_timer_group_reg_irq,
	.hal_timer_reg_toirq = hal_rtl_timer_reg_toirq,
	.hal_timer_unreg_toirq = hal_rtl_timer_unreg_toirq,
	.hal_timer_reg_meirq = hal_rtl_timer_reg_meirq,
	.hal_timer_unreg_meirq = hal_rtl_timer_unreg_meirq,
	.hal_timer_set_tick_time = hal_rtl_timer_set_tick_time,
	.hal_timer_init_free_run = hal_rtl_timer_init_free_run,
	.hal_timer_indir_read = hal_rtl_timer_indir_read,
	.hal_timer_read_us = hal_rtl_timer_read_us,
	.hal_timer_read_us64 = hal_rtl_timer_read_us64,
	.hal_timer_init = hal_rtl_timer_init,
	.hal_timer_set_timeout = hal_rtl_timer_set_timeout,
	.hal_timer_start = hal_rtl_timer_start,
	.hal_timer_enable_match_event = hal_rtl_timer_enable_match_event,
	.hal_timer_start_one_shot = hal_rtl_timer_start_one_shot,
	.hal_timer_start_periodical = hal_rtl_timer_start_periodical,
	.hal_timer_allocate = hal_rtl_timer_allocate,
	.hal_timer_event_init = hal_rtl_timer_event_init,
	.hal_timer_event_deinit = hal_rtl_timer_event_deinit,
#if !defined(CONFIG_BUILD_NONSECURE)
	.hal_timer_clock_init = hal_rtl_timer_clock_init,
	.hal_timer_group_sclk_sel = hal_rtl_timer_group_sclk_sel,
#endif


	// hal_misc timer related API
	.ppsys_timer = &psystem_timer,
	.hal_read_systime = hal_rtl_misc_read_systime,
	.hal_read_curtime = hal_rtl_misc_read_curtime,
	.hal_start_systimer = hal_rtl_misc_start_systimer,
	.hal_delay_us = hal_rtl_misc_delay_us,
	.hal_is_timeout = hal_rtl_misc_is_timeout
};

/**
 *  @brief To set timer number according to timer group ID
 *
 *  @param[in] tg_id The ID of timer group.
 *
 *  @returns The timer number in the timer group.
 */
SECTION_GTIMER_TEXT
u8 hal_rtl_timer_num_select(u8 tg_id)
{
	switch (tg_id) {
	case 0:
		return 8;
		break;
	case 1:
		return 1;
		break;
	case 2:
		return 8;
		break;
	case 3:
		return 1;
		break;
	}
	return HAL_OK;
}


/**
 *  @brief To convert a tick count to the time period in us
 *
 *  @param[in] ticks The number of ticks.
 *  @param[in] sclk_idx The timer SCLK selection.
 *
 *  @returns The converted time period in us.
 */
SECTION_GTIMER_TEXT
u32 hal_rtl_timer_convert_ticks_to_us(u32 ticks, u8 sclk_idx)
{
	u32 remain_count;
	u32 ms125;
	u32 tick_cnt_125ms;

