swang-wyze/AmebaPro2_SDK_v9.0a/component/soc/8735b/fwlib/rtl8735b/lib/source/rom/rtl8735b_timer.c
	tick_cnt_125ms = gtimer_sclk_tick_cnt_125ms[sclk_idx];
	if (ticks >= tick_cnt_125ms) {
		ms125 = ticks / tick_cnt_125ms;
		remain_count = ticks - (ms125 * tick_cnt_125ms);
		return (125000 * ms125) + (remain_count * 1000000 / gtimer_sclk_freq[sclk_idx]);
	} else {
		return (ticks * 1000000 / gtimer_sclk_freq[sclk_idx]);
	}
}

/**
 *  @brief To convert a time period in us to number of 32K ticks
 *
 *  @param[in] time_us The timer period in us.
 *  @param[in] sclk_idx The timer SCLK selection.
 *
 *  @returns The converted 32K ticks.
 */
SECTION_GTIMER_TEXT
u32 hal_rtl_timer_convert_us_to_ticks(u32 time_us, u8 sclk_idx)
{
	u32 ms125;
	u32 remain_time;
	u32 ticks;
	u32 sclk_freq;

	sclk_freq = gtimer_sclk_freq[sclk_idx];
	if (time_us >= 125000) {
		ms125 = time_us / 125000;
		remain_time = time_us - (ms125 * 125000);
		ticks = (ms125 * gtimer_sclk_tick_cnt_125ms[sclk_idx]) + (remain_time * sclk_freq / 1000000);
	} else {
		remain_time = time_us;
		ticks = time_us * sclk_freq / 1000000;
	}

	if (((remain_time * sclk_freq) % 1000000) >= 500000) {
		ticks++;
	}

	if ((ticks == 0) && (time_us > 0)) {
		// at least 1 tick
		ticks = 1;
	}
	return ticks;
}

/**
 *  @brief To convert a tick count to the time period in us
 *
 *  @param[in] ticks The number of ticks.
 *  @param[in] sclk_idx The timer SCLK selection.
 *
 *  @returns The converted time period in us.
 */
SECTION_GTIMER_TEXT
u64 hal_rtl_timer_convert_ticks_to_us64(u64 ticks, u8 sclk_idx)
{
	u64 remain_count;
	u64 ms125;
	u64 tick_cnt_125ms;

	tick_cnt_125ms = (u64)gtimer_sclk_tick_cnt_125ms[sclk_idx];

	if (ticks >= tick_cnt_125ms) {
		ms125 = ticks / tick_cnt_125ms;
		remain_count = ticks - (ms125 * tick_cnt_125ms);
		return ((u64)125000 * ms125) + (remain_count * (u64)1000000 / gtimer_sclk_freq[sclk_idx]);
	} else {
		return ((ticks * (u64)1000000) / (u64)gtimer_sclk_freq[sclk_idx]);
	}
}

/**
 *  @brief To convert a time period in us to number of 32K ticks
 *
 *  @param[in] time_us The timer period in us.
 *  @param[in] sclk_idx The timer SCLK selection.
 *
 *  @returns The converted 32K ticks.
 */
SECTION_GTIMER_TEXT
u64 hal_rtl_timer_convert_us_to_ticks64(u64 time_us, u8 sclk_idx)
{
	u64 ms125;
	u64 remain_time;
	u64 ticks;
	u64 sclk_freq;

	sclk_freq = (u64)gtimer_sclk_freq[sclk_idx];
	if (time_us >= (u64)125000) {
		ms125 = time_us / (u64)125000;
		remain_time = time_us - (ms125 * (u64)125000);
		ticks = (ms125 * (u64)gtimer_sclk_tick_cnt_125ms[sclk_idx]) + (remain_time * sclk_freq / (u64)1000000);
	} else {
		remain_time = time_us;
		ticks = time_us * sclk_freq / (u64)1000000;
	}

	if (((remain_time * sclk_freq) % (u64)1000000) >= 500000) {
		ticks++;
	}

	if ((ticks == 0) && (time_us > 0)) {
		// at least 1 tick
		ticks = 1;
	}
	return ticks;
}

/**
 *  @brief To handle the timer counter overfloe/underflow interrupt.
 *
 *  @param[in] ptimer_adp The timer adapter.
 *
 *  @returns void
 */
SECTION_GTIMER_TEXT
void hal_timer_free_run_overflow_handler_rtl8195bhp(phal_timer_adapter_t ptimer_adp)
{
	ptimer_adp->overflow_fired++;
}

/**
 *  @brief The Common IRQ handler of G-Timer group.
 *
 *  @param[in] hid.
 *
 *  @returns void
 */
SECTION_GTIMER_TEXT
void hal_rtl_timer_irq_handler(void *hid)
{
	hal_timer_group_adapter_t *ptg = (hal_timer_group_adapter_t *)hid;
	phal_timer_adapter_t ptimer_adp;
	u8 tg_int_sts;
	u8 tmr_num;
	//tm_isr_t tmr_int_sts;
	u32 i;
	u32 j;

	if (NULL == ptg) {
		return;
	}

	tmr_num = hal_rtl_timer_num_select(ptg->tgid);
	//dbg_printf("tg %x\r\n", ptg->tgid);

	tg_int_sts = hal_rtl_timer_group_get_ists(ptg);
	//dbg_printf("isr1 %x\r\n", tg_int_sts);
	for (i = 0; i < tmr_num; i++) {
		if (tg_int_sts & (1 << i)) {
			ptimer_adp = ptg->timer_adapter[i];
			if (ptimer_adp == NULL) {
				// no adapter for this G-Timer

				TM_TypeDef *PTMR;
				u32 ISR;
				PTMR = (TM_TypeDef *)((uint32_t)(ptg->tg_ba) + ((i + 1) * GTIMER_REG_SIZE));
				ISR = PTMR->TM_ISR;
				ISR &= 0xFF;
				PTMR->TM_ISR = ISR;

				continue;
			}

			u32 ISR;
			TM_TypeDef *TM_OBJ = (TM_TypeDef *)(ptimer_adp->tmr_ba);
			ISR = TM_OBJ->TM_ISR;
			TM_OBJ->TM_ISR |= ISR;

			tg_int_sts = hal_rtl_timer_group_get_ists(ptg);

			// Timeout interrupt
			if ((ISR & TM_BIT_TIMEOUT) == 0x1) {
				if (ptimer_adp->reload_mode != GTimerPeriodical) {
					hal_rtl_timer_disable(ptimer_adp);
				}

//                ptimer_adp->tmr_ba->isr_b.timeout = 1;  // write 1 to clear ISR
				if (ptimer_adp->timeout_callback != NULL) {
					ptimer_adp->timeout_callback(ptimer_adp->to_cb_para);
				}
				ISR = ISR & (~TM_BIT_TIMEOUT);
				if (ISR == 0) {
					continue;
				}
			}

			// Check Timer counter match event 0 ~ 3 interrupt
			for (j = 0; j < 4; j++) {
				if (ISR & (1 << (j + 1))) {
					if (ptimer_adp->me_callback[j] != NULL) {
						ptimer_adp->me_callback[j](ptimer_adp->me_cb_para[j]);
					}
					ISR &= ~(1 << (j + 1));
					if (ISR == 0) {
						break; // break for loop
					}
				}
			}
		}
	}

	__DSB();
	__ISB();
}

/**
 *  @brief The IRQ handler of G-Timer group 0.
 *
 *  @returns void
 */
SECTION_GTIMER_TEXT
void TimerGroup0_IRQHandler(void)
{
	hal_rtl_irq_clear_pending(TimerGroup0_IRQn);
	hal_rtl_timer_irq_handler(ptimer_group0);
}

/**
 *  @brief The IRQ handler of G-Timer group 1.
 *
 *  @returns void
 */
SECTION_GTIMER_TEXT
void TimerGroup1_IRQHandler(void)
{
	hal_rtl_irq_clear_pending(TimerGroup1_IRQn);
	hal_rtl_timer_irq_handler(ptimer_group1);
}

/**
 *  @brief The IRQ handler of G-Timer group 1.
 *
 *  @returns void
 */
SECTION_GTIMER_TEXT
void TimerGroup2_IRQHandler(void)
{
	hal_rtl_irq_clear_pending(TimerGroup2_IRQn);
	hal_rtl_timer_irq_handler(ptimer_group2);
}

/**
 *  @brief The IRQ handler of G-Timer group 1.
 *
 *  @returns void
 */
SECTION_GTIMER_TEXT
void TimerGroup3_IRQHandler(void)
{
	hal_rtl_irq_clear_pending(TimerGroup3_IRQn);
	hal_rtl_timer_irq_handler(ptimer_group3);
}



/**
 *  @brief To enable/disbale the timer counter match event.
 *
 *  @param[in] ptimer_adp The timer adapter.
 *  @param[in] match_ev The match event number(0 ~ 3).
 *  @param[in] enable Enable control. (1: enable, 0: disable)
 *
 *  @returns void
 */
SECTION_GTIMER_TEXT
void hal_rtl_timer_me_ctrl(phal_timer_adapter_t ptimer_adp, timer_match_event_t match_ev, u8 enable)
{
	if (match_ev >= MaxGTimerMatchEvent) {
		DBG_TIMER_ERR("hal_rtl_timer_me_ctrl: Invalid ME number (%u)\r\n", match_ev);
	}

