swang-wyze/AmebaPro2_SDK_v9.0a/component/soc/8735b/fwlib/rtl8735b/lib/source/rom/rtl8735b_timer.c
	TM_TypeDef *TM_OBJ = (TM_TypeDef *)(ptimer_adp->tmr_ba);
	u32 MecTrl;

	MecTrl = TM_OBJ->TM_MECTRL;

	if (enable) {
		MecTrl |= 1 << match_ev;
	} else {
		MecTrl &= ~(1 << match_ev);
	}

	TM_OBJ->TM_MECTRL = MecTrl;

}

/**
 *  @brief To set the counter number of a counter match event.
 *
 *  @param[in] ptimer_adp The timer adapter.
 *  @param[in] match_ev The match event number(0 ~ 3).
 *  @param[in] counter The counter value for the timer match filer to match to.
 *
 *  @returns void
 */
SECTION_GTIMER_TEXT
void hal_rtl_timer_set_me_counter(phal_timer_adapter_t ptimer_adp, timer_match_event_t match_ev, u32 counter)
{
	TM_TypeDef *TM_OBJ = (TM_TypeDef *)(ptimer_adp->tmr_ba);
	//u32 MecTrl;

	switch (match_ev) {
	case GTimerMatchEvent0:
		TM_OBJ->TM_ME0 = TM_MASK_ME0 & counter;
		break;

	case GTimerMatchEvent1:
		TM_OBJ->TM_ME1 = TM_MASK_ME1 & counter;
		break;

	case GTimerMatchEvent2:
		TM_OBJ->TM_ME2 = TM_MASK_ME2 & counter;
		break;

	case GTimerMatchEvent3:
		TM_OBJ->TM_ME3 = TM_MASK_ME3 & counter;
		break;

	default:
		DBG_TIMER_ERR("hal_rtl_timer_set_me_counter: Invalid ME number (%u)\r\n", match_ev);
	}
}

#if 1

/**
 *  @brief To enable or disable a timer group block.
 *
 *  @param[in] tgid The timer group ID(index).
 *  @param[in] en  Enable control: 0: disable, 1: enable.
 *
 *  @returns void
 */
SECTION_GTIMER_TEXT
void hal_rtl_timer_group_en_ctrl(uint32_t tgid, BOOL en)
{

//    switch (tgid)
//        {
//        case 0:
//            HAL_WRITE32(0x40009800, 0x24, 0x2); // Enable timer0 block
//            break;
//        case 1:
//            HAL_WRITE32(0x50008000, 0x104, 0x2); // Enable timer2 block
//            break;
//        case 2:
//            HAL_WRITE32(0x40009800, 0x24, 0x2); // Enable timer0 block
//            break;
//        case 3:
//            HAL_WRITE32(0x40009800, 0x24, 0x2); // Enable timer0 block
//            break;
//        }
}

/**
 *  @brief To enable/disable the APB clock for timer group block.
 *
 *  @param[in] tgid The timer group ID(index).
 *  @param[in] en  Enable control: 0: disable, 1: enable.
 *
 *  @returns void
 */
SECTION_GTIMER_TEXT
void hal_rtl_timer_group_pclk_ctrl(uint32_t tgid, BOOL en)
{
//    if (!tgid) {
//        SYSON->hs_timer_ctrl_b.hs_tg0_pclk_en = en;
//    } else {
//        SYSON->hs_timer_ctrl_b.hs_tg1_pclk_en = en;
//    }
}

/**
 *  @brief To enable/disable the system clock for timer group block.
 *
 *  @param[in] tgid The timer group ID(index).
 *  @param[in] en  Enable control: 0: disable, 1: enable.
 *
 *  @returns void
 */
SECTION_GTIMER_TEXT
void hal_rtl_timer_group_sclk_ctrl(uint32_t tgid, BOOL en)
{
//    if (!tgid) {
//        SYSON->hs_timer_ctrl_b.hs_tg0_sclk_en = en;
//    } else {
//        SYSON->hs_timer_ctrl_b.hs_tg1_sclk_en = en;
//    }
}

/**
 *  @brief To select the clock source for timer group block interrupt.
 *         When in sleep mode, just can use the SCLK for the interrupr circute.
 *
 *  @param[in] tgid The timer group ID(index).
 *  @param[in] clk_sel  The clock source selection: 0: APB clock, 1: SCLK.
 *
 *  @returns void
 */

SECTION_GTIMER_TEXT
void hal_rtl_timer_group_intclk_sel(uint32_t tgid, timer_interrupt_clk_t clk_sel)
{

#if !defined(CONFIG_BUILD_NONSECURE)

//    #define PON     0x40009800
//    #define S_SYSON 0x50000800

	u32 val;
	if (tgid == 0) {
		val = HAL_READ32(0x40009800, 0x2C);
		if (clk_sel == 0) {
			val &= ~(PON_BIT_INTR_CLK_TIMER0_SEL);
		} else {
			val |= (PON_BIT_INTR_CLK_TIMER0_SEL);
		}
		HAL_WRITE32(0x40009800, 0x2C, val);
	} else if (tgid == 1) {
		val = HAL_READ32(0x50000800, 0x104);
		if (clk_sel == 0) {
			val &= ~(SYSON_S_BIT_SYS_TG1_INTR_CLK_SEL);
		} else {
			val |= (SYSON_S_BIT_SYS_TG1_INTR_CLK_SEL);
		}
		HAL_WRITE32(0x50000800, 0x104, val);
	} else if (tgid == 2) {
		val = HAL_READ32(0x50000800, 0x104);
		if (clk_sel == 0) {
			val &= ~(SYSON_S_BIT_SYS_TG2_INTR_CLK_SEL);
		} else {
			val |= (SYSON_S_BIT_SYS_TG2_INTR_CLK_SEL);
		}
		HAL_WRITE32(0x50000800, 0x104, val);
	} else if (tgid == 3) {
		val = HAL_READ32(0x50000800, 0x104);
		if (clk_sel == 0) {
			val &= ~(SYSON_S_BIT_SYS_TG3_INTR_CLK_SEL);
		} else {
			val |= (SYSON_S_BIT_SYS_TG3_INTR_CLK_SEL);
		}
		HAL_WRITE32(0x50000800, 0x104, val);
	}

#endif
}



/**
 *  @brief To select the source clock of a timer group.
 *
 *  @param[in] ptg_adp The timer group adapter.
 *  @param[in] sclk_freq The source clock freq.
 *
 *  @returns void
 */

#endif

#if !defined(CONFIG_BUILD_NONSECURE)
SECTION_GTIMER_TEXT
hal_status_t hal_rtl_timer_group_sclk_sel(hal_timer_group_adapter_t *ptg_adp, uint32_t sclk_freq)
{
	//uint8_t i;
	//uint32_t sclk_idx;
	//u32 val;

	if (sclk_freq > 4) {
		return HAL_ERR_PARA;
	} else {
		ptg_adp->sclk_idx = sclk_freq;
		if (sclk_freq == GTimerSClk_MAXID) {
			ptg_adp->sclk_idx = GTimerSClk_4M; // use default 4M
		}
	}

	if (ptg_adp->tgid == 0) {
		hal_rtl_sys_set_clk(TIMER0_SYS, ptg_adp->sclk_idx);
	} else if (ptg_adp->tgid == 1) {
		hal_rtl_sys_set_clk(TIMER1_SYS, ptg_adp->sclk_idx);
	} else if (ptg_adp->tgid == 2) {
		hal_rtl_sys_set_clk(TIMER2_SYS, ptg_adp->sclk_idx);
	} else if (ptg_adp->tgid == 3) {
		hal_rtl_sys_set_clk(TIMER3_SYS, ptg_adp->sclk_idx);
	}


	return HAL_OK;

}
#endif


#if !defined(CONFIG_BUILD_NONSECURE)
SECTION_GTIMER_TEXT
void hal_rtl_timer_clock_init(uint32_t tgid, int en)
{
	if (tgid == 0) {
		hal_rtl_sys_peripheral_en(TIMER0_SYS, en);   // Enable TIMER clock and power on PON
	} else if (tgid == 2) {
		hal_rtl_sys_peripheral_en(TIMER2_SYS, en);   // Enable TIMER clock and power on SYSON_S
	} else if (tgid == 1) {
		hal_rtl_sys_peripheral_en(TIMER1_SYS, en);   // Enable TIMER clock and power on SYSON_S
	} else if (tgid == 3) {
		hal_rtl_sys_peripheral_en(TIMER3_SYS, en);   // Enable TIMER clock and power on SYSON_S
	}
}
#endif

/**
 *  @brief To initial a HW timer group adapter.
 *
 *  @param[in] ptg_adp The timer group adapter.
 *  @param[in] tgid The timer group ID(index).
 *
 *  @returns void
 */
#define sys_ok 0

SECTION_GTIMER_TEXT
void hal_rtl_timer_group_init(hal_timer_group_adapter_t *ptg_adp, uint32_t tgid)
{
	//uint8_t GTIMER_GROUP_TIMER_NUM;
	u8 tmr_num;
	uint32_t i;
	//volatile uint32_t ists;
	//TM_TypeDef *ptmr;
	//u32 val;

//#if !defined(CONFIG_BUILD_NONSECURE)
//
//    #define APB_clk 0
//    #define PON     0x40009800
//    #define S_SYSON 0x50000800
//
//    hal_rtl_timer_clock_init(tgid);
//#endif

