swang-wyze/AmebaPro2_SDK_v9.0a/component/soc/8735b/fwlib/rtl8735b/lib/source/rom/rtl8735b_timer.c
	_memset((void *)ptg_adp, 0, sizeof(hal_timer_group_adapter_t));
	switch (tgid) {
	case 0:
		ptimer_group0 = ptg_adp;
		ptg_adp->tg_ba = (TG_TypeDef *)TIMER_GROUP0_REG_BASE; // TG0
		ptg_adp->tgid = 0;
		break;

	case 1:
		ptimer_group1 = ptg_adp;
		ptg_adp->tg_ba = (TG_TypeDef *)TIMER_GROUP1_REG_BASE; // TG1
		ptg_adp->tgid = 1;
		break;

	case 2:
		ptimer_group2 = ptg_adp;
		ptg_adp->tg_ba = (TG_TypeDef *)TIMER_GROUP2_REG_BASE; // TG2
		ptg_adp->tgid = 2;
		break;

	case 3:
		ptimer_group3 = ptg_adp;
		ptg_adp->tg_ba = (TG_TypeDef *)TIMER_GROUP3_REG_BASE; // TG3
		ptg_adp->tgid = 3;
		break;
	}

	TG_TypeDef *TG_OBJ = (TG_TypeDef *)(ptg_adp->tg_ba);
	TM_TypeDef *PTMR = (TM_TypeDef *)(ptg_adp->tg_ba);
	volatile u32 ISTS;
	volatile u32 ISR;

	ISTS = TG_OBJ->TG_ISTS;
	tmr_num = hal_rtl_timer_num_select(tgid);

	if (ISTS != 0) {
		for (i = 0; i < tmr_num; i++) {
			if ((ISTS & (1 << i)) != 0) {
				PTMR = (TM_TypeDef *)timer_base_address[i + (tmr_num * (tgid & 0x01))];
				ISR = PTMR->TM_ISR;
				ISR &= 0xFF;
				PTMR->TM_ISR = ISR;
			}
		}
	}

	if (tgid == 0) {
		hal_rtl_timer_group_reg_irq(ptg_adp, (irq_handler_t)TimerGroup0_IRQHandler);
		hal_rtl_irq_set_priority(TimerGroup0_IRQn, TimerGroup0_IRQPri);
	} else if (tgid == 1) {
		hal_rtl_timer_group_reg_irq(ptg_adp, (irq_handler_t)TimerGroup1_IRQHandler);
		hal_rtl_irq_set_priority(TimerGroup1_IRQn, TimerGroup1_IRQPri);
	} else if (tgid == 2) {
		hal_rtl_timer_group_reg_irq(ptg_adp, (irq_handler_t)TimerGroup2_IRQHandler);
		hal_rtl_irq_set_priority(TimerGroup2_IRQn, TimerGroup2_IRQPri);
	} else if (tgid == 3) {
		hal_rtl_timer_group_reg_irq(ptg_adp, (irq_handler_t)TimerGroup3_IRQHandler);
		hal_rtl_irq_set_priority(TimerGroup3_IRQn, TimerGroup3_IRQPri);
	}
}

/**
 *  @brief To de-initial(disable) a HW timer group adapter.
 *
 *  @param[in] ptg_adp The timer group adapter.
 *
 *  @returns void
 */
SECTION_GTIMER_TEXT
void hal_rtl_timer_group_deinit(hal_timer_group_adapter_t *ptg_adp)
{
	uint32_t tgid = ptg_adp->tgid;

//    hal_rtl_timer_group_en_ctrl (tgid, GTimer_Disable);
//    hal_rtl_timer_group_pclk_ctrl (tgid, GTimer_Disable);
//    hal_rtl_timer_group_sclk_ctrl (tgid, GTimer_Disable);

	if (tgid == 0) {
		hal_rtl_irq_disable(TimerGroup0_IRQn);
		__ISB();
		ptimer_group0 = NULL;
	} else if (tgid == 1) {
		hal_rtl_irq_disable(TimerGroup1_IRQn);
		__ISB();
		ptimer_group1 = NULL;
	} else if (tgid == 2) {
		hal_rtl_irq_disable(TimerGroup2_IRQn);
		__ISB();
		ptimer_group2 = NULL;
	} else if (tgid == 3) {
		hal_rtl_irq_disable(TimerGroup3_IRQn);
		__ISB();
		ptimer_group3 = NULL;
	}
}

/**
 *  @brief To initial a HW timer adapter.
 *
 *  @param[in] ptimer_adp The timer adapter.
 *  @param[in] tid The timer ID(index).
 *
 *  @returns     HAL_OK:  Setting succeed.
 *  @returns     HAL_ERR_PARA:  Input arguments are invalid.
 *  @returns     HAL_BUSY:  The Timer setting was not ready.
 */
SECTION_GTIMER_TEXT
hal_status_t hal_rtl_timer_bare_init(phal_timer_adapter_t ptimer_adp, timer_id_t tid, u8 tg)
{
	TM_TypeDef *tmr_ba;
	hal_timer_group_adapter_t *ptg_adp;
	u32 tg_tid = 0;
	//u8 tmr_num;

	if (tg == 0 || tg == 2) {

		if (tid < GTIMER_GROUP_TIMER_NUM) {
			ptg_adp = ptimer_group0;
			//dbg_printf("pg0\r\n");
		} else {
			ptg_adp = ptimer_group2;
			//dbg_printf("pg2\r\n");
		}

		if ((ptimer_adp == NULL) || (tid >= MaxGTimerNum) || (ptg_adp == NULL)) {
			DBG_TIMER_ERR("hal_timer_bare: tg_adp=0x%x, ptimer_adp=0x%x, tid=%u\r\n", ptg_adp, ptimer_adp, tid);
			return HAL_ERR_PARA;
		}

		tg_tid = tid % GTIMER_GROUP_TIMER_NUM;
		//dbg_printf("tid tg_tid %x %x\r\n", tid, tg_tid);
		tmr_ba = (TM_TypeDef *)timer_base_address[tid];

		if (ptg_adp->tmr_in_use & (1 << tg_tid)) {
			return HAL_BUSY;
		}
	} else if (tg == 1) {
		ptg_adp = ptimer_group1;
		tg_tid = 0;
		tmr_ba = (TM_TypeDef *)TM8_REG_BASE;  // TM8
	} else if (tg == 3) {
		ptg_adp = ptimer_group3;
		tg_tid = 0;
		tmr_ba = (TM_TypeDef *)TM17_REG_BASE; // TM17
	} else {
		return HAL_ERR_PARA;
	}

	ptimer_adp->tid = tid;
	ptg_adp->timer_adapter[tg_tid] = ptimer_adp;
	ptg_adp->tmr_in_use |= (1 << tg_tid);
	//tmr_ba = (TM_Type *)timer_base_address[tid];
	ptimer_adp->tmr_ba = tmr_ba;
	tmr_ba->TM_CTRL = 0;
	//tmr_ba->ctrl = 0; // default setting: disable, timer mode, unmask interrupt, up counter
	ptimer_adp->tg_ba = ptg_adp->tg_ba;
	ptimer_adp->ptg_adp = ptg_adp;

	return HAL_OK;
}

/**
 *  @brief To de-initial a HW timer adapter.
 *
 *  @param[in] ptimer_adp The timer adapter.
 *
 *  @returns void
 */
SECTION_GTIMER_TEXT
void hal_rtl_timer_deinit(phal_timer_adapter_t ptimer_adp)
{
	hal_timer_group_adapter_t *ptg_adp;
	TM_TypeDef *TM_OBJ = (TM_TypeDef *)(ptimer_adp->tmr_ba);
	u8 tid;
	u8 tg_tid;

	tid = ptimer_adp->tid;
	tg_tid = tid % GTIMER_GROUP_TIMER_NUM;

	TM_OBJ->TM_CTRL = TM_OBJ->TM_CTRL & (~TM_BIT_EN);
	ptg_adp = ptimer_adp->ptg_adp;
	ptg_adp->timer_adapter[tg_tid] = NULL;
	ptg_adp->tmr_in_use &= ~(1 << tg_tid);



#if 0
	// if no more timer is using this IRQ then un-register the IRQ
	for (i = 0; i < GTIMER_GROUP_TIMER_NUM; i++) {
		if (ptg_adp->timer_adapter[i] != NULL) {
			if (ptg_adp->timer_adapter[i]->timeout_callback != NULL) {
				break;
			}
		}
	}

	if (i >= GTIMER_GROUP_TIMER_NUM) {
		// No active timer, disable the G-Timer interrupt
		if (tid == 0) {
			hal_irq_disable_rtl8195bhp(TimerGroup0_IRQn);
		} else {
			hal_irq_disable_rtl8195bhp(TimerGroup1_IRQn);
		}
	}
#endif
}

/**
 *  @brief To register a IRQ handler for a timer group.
 *
 *  @param[in] ptimer_adp The timer adapter.
 *  @param[in] irq_handler The call back function of the IRQ.
 *
 *  @returns void
 */
SECTION_GTIMER_TEXT
void hal_rtl_timer_group_reg_irq(hal_timer_group_adapter_t *ptg_adp, irq_handler_t irq_handler)
{
	int32_t irqn = 1;

#if 0
	if (ptg_adp->tgid == 0) {
		irqn = TimerGroup0_IRQn;
	} else {
		irqn = TimerGroup1_IRQn;
	}
#endif

	switch (ptg_adp->tgid) {
	case 0:
		irqn = TimerGroup0_IRQn;
		break;
	case 1:
		irqn = TimerGroup1_IRQn;
		break;
	case 2:
		irqn = TimerGroup2_IRQn;
		break;
	case 3:
		irqn = TimerGroup3_IRQn;
		break;
	}

	// IRQ vector may has been registered, disable and re-register it
	hal_rtl_irq_disable(irqn);
	//hal_irq_disable_rtl8195bhp (irqn);
	__ISB();
	hal_rtl_irq_set_vector(irqn, (uint32_t)irq_handler);
	hal_rtl_irq_enable(irqn);
}

/**
 *  @brief To register a timer timeout IRQ call back function
 *
 *  @param[in] ptimer_adp The timer adapter.
 *  @param[in] callback The call back function.
 *  @param[in] phid The argument for call back function calling.
 *
 *  @returns void
 */
SECTION_GTIMER_TEXT
void hal_rtl_timer_reg_toirq(phal_timer_adapter_t ptimer_adp, timer_callback_t callback, void *phid)
{
	ptimer_adp->timeout_callback = callback;
	ptimer_adp->to_cb_para = phid;
}

/**
 *  @brief To un-register a timer timeout IRQ call back function
 *
 *  @param[in] ptimer_adp The timer adapter.
 *
 *  @returns void
 */
SECTION_GTIMER_TEXT
void hal_rtl_timer_unreg_toirq(phal_timer_adapter_t ptimer_adp)
{
	ptimer_adp->timeout_callback = (timer_callback_t)NULL;
	ptimer_adp->to_cb_para = (void *)NULL;
}

/**
 *  @brief To register a timer counter matched IRQ call back function
 *
 *  @param[in] ptimer_adp The timer adapter.
 *  @param[in] match_ev The timer counter match event number (0 ~ 3).
 *  @param[in] callback The call back function.
 *  @param[in] phid The argument for call back function calling.
 *
 *  @returns void
 */
SECTION_GTIMER_TEXT
void hal_rtl_timer_reg_meirq(phal_timer_adapter_t ptimer_adp, u8 match_ev,
							 timer_callback_t callback, void *phid)
{
	if (match_ev >= 4) {
		DBG_TIMER_ERR("hal_rtl_timer_reg_meirq: Invalid ME number (%u)\r\n", match_ev);
		return;
	}
	ptimer_adp->me_callback[match_ev] = callback;
	ptimer_adp->me_cb_para[match_ev] = phid;
}

/**
 *  @brief To un-register a timer counter matched IRQ call back function
 *
 *  @param[in] ptimer_adp The timer adapter.
 *  @param[in] match_ev The timer counter match event number (0 ~ 3).
 *
 *  @returns void
 */
SECTION_GTIMER_TEXT
void hal_rtl_timer_unreg_meirq(phal_timer_adapter_t ptimer_adp, u8 match_ev)
{
	if (match_ev >= 4) {
		DBG_TIMER_ERR("hal_timer_unreg_meirq: Invalid ME number (%u)\r\n", match_ev);
		return;
	}

	ptimer_adp->me_callback[match_ev] = (timer_callback_t)NULL;
	ptimer_adp->me_cb_para[match_ev] = (void *)NULL;
}

/**
 *  @brief To configure the tick period of a timer by set the pre-scaler value.
 *
 *  @param[in] ptimer_adp The timer adapter.
 *  @param[in] tick_ns The period (in ns) of a tick
 *
 *  @returns The real tick time, in ns.
 */
SECTION_GTIMER_TEXT
u32 hal_rtl_timer_set_tick_time(phal_timer_adapter_t ptimer_adp, u32 tick_ns)
{
	u32 scaler;
	u8 sclk_idx;
	u64 tick_ns_tmp;

	sclk_idx = ptimer_adp->ptg_adp->sclk_idx;
	tick_ns_tmp = (u64)tick_ns * (u64)gtimer_sclk_freq[sclk_idx];
//    tick_ns_tmp = div_u64 (((u64)tick_ns * (u64)gtimer_sclk_freq[sclk_idx] ), 1000000000);
	// x / N = (x*A)/2^(32+n)  -->  A = 2^(32+n)/N --> N = 1000000000, n=16 --> A = 281475
	tick_ns_tmp = (tick_ns_tmp * (u64)281475) >> 48;  // * 10^-9
	scaler = (u32)tick_ns_tmp;
	if (scaler > 1024) {
		DBG_TIMER_INFO("hal_rtl_timer_set_tick_time: invalid pre-scaler %lu\r\n", scaler);
		scaler = 1024;
	}

	if (scaler > 0) {
		scaler -= 1;
	}
	hal_rtl_timer_set_prescal(ptimer_adp, (u16)scaler);
	scaler++;
	ptimer_adp->pre_scaler = (u16)(scaler);
	ptimer_adp->tick_us = 1000000 * (scaler) / gtimer_sclk_freq[sclk_idx];
//    tick_ns_tmp = 1000000000 * (scaler) / gtimer_sclk_freq[sclk_idx];
//    tick_ns_tmp =  tick_ns_tmp - (ptimer_adp->tick_us * 1000);
//    ptimer_adp->tick_r_ns = (u32)tick_ns_tmp;
	ptimer_adp->tick_r_ns = 1000000000 / gtimer_sclk_freq[sclk_idx] * scaler;
	ptimer_adp->tick_r_ns -= (ptimer_adp->tick_us * 1000);
	return ((ptimer_adp->tick_us * 1000) + ptimer_adp->tick_r_ns);
}

/**
 *  @brief To initial a HW timer as a free run counter mode.
 *
 *  @param[in] ptimer_adp The timer adapter.
 *  @param[in] tid The timer ID(index).
 *  @param[in] cnt_mode The count mode, up count or down count.
 *  @param[in] tick_us The period (in us) of a tick
 *
 *  @returns void.
 */
SECTION_GTIMER_TEXT
void hal_rtl_timer_init_free_run(phal_timer_adapter_t ptimer_adp, timer_id_t tid,
								 timer_cnt_mode_t cnt_mode, u32 tick_us, u8 tg)
{
	u32 tick_ns;
	u32 max_tick_ns;
	u8 sclk_idx;

	//dbg_printf("tg tid %x %x\r\n", tg, tid);

	hal_rtl_timer_bare_init(ptimer_adp, tid, tg);
	hal_rtl_timer_set_opmode(ptimer_adp, GTimerMode_Timer);
	hal_rtl_timer_set_cntmode(ptimer_adp, cnt_mode);
	hal_rtl_timer_set_imr(ptimer_adp, 0);    // disable interrupt

	//dbg_printf("f1\r\n");

	// Configure the pre-scale
	sclk_idx = ptimer_adp->ptg_adp->sclk_idx;
	max_tick_ns = gtimer_max_tick[sclk_idx];
	tick_ns = tick_us * 1000;
	if (tick_ns > max_tick_ns) {
		tick_ns = max_tick_ns;
	}
	hal_rtl_timer_set_tick_time(ptimer_adp, tick_ns);
	hal_rtl_timer_set_reload(ptimer_adp, 0xffffffff);
	//dbg_printf("f2\r\n");
	hal_rtl_timer_reg_toirq(ptimer_adp, (timer_callback_t)hal_timer_free_run_overflow_handler_rtl8195bhp, \
							ptimer_adp);
	hal_rtl_timer_set_imr(ptimer_adp, 1);    // enable interrupt

	hal_rtl_timer_enable(ptimer_adp);
}

/**
 *  @brief To indirect read the timer counter value
 *
 *  @param[in] ptimer_adp The timer adapter.
 *
 *  @returns The timer counter value
 */
SECTION_GTIMER_TEXT
u32 hal_rtl_timer_indir_read(phal_timer_adapter_t ptimer_adp)
{
	TG_TypeDef *TG_OBJ = (TG_TypeDef *)(ptimer_adp->tg_ba);
	//tg_tsel_t tsel;
	uint32_t i;
	u32 TSEL;
	TSEL = 0;


	TSEL = TSEL | (TG_MASK_TSEL & ptimer_adp->tid);
	TSEL = TSEL | TG_BIT_POLL;

	if (ptimer_adp->ptg_adp->sclk_idx == GTimerSClk_40M) {
		TSEL = TSEL | TG_BIT_SYNC_MODE;
	}

