swang-wyze/AmebaPro2_SDK_v9.0a/component/soc/8735b/fwlib/rtl8735b/lib/source/rom/rtl8735b_timer.c
	TG_OBJ->TG_TSEL = TSEL;

	for (i = 0; i < 1000000; i++) {
		if ((TG_OBJ->TG_TSEL & TG_BIT_POLL) == 0) {
			break;
		} else {
			__NOP();
			__NOP();
			__NOP();
			__NOP();
		}
	}

	return TG_OBJ->TG_TC;
}


/**
 *  @brief To read the counter and convert it as us unit.
 *
 *  @param[in] ptimer_adp The timer adapter.
 *
 *  @returns The counter value in us.
 */
SECTION_GTIMER_TEXT
u64 hal_rtl_timer_read_us(phal_timer_adapter_t ptimer_adp)
{
	u32 count;
	u64 ns2us;

//    count = hal_timer_read_rtl8195bhp (ptimer_adp);
	count = hal_rtl_timer_indir_read(ptimer_adp);
	if (ptimer_adp->tick_r_ns == 0) {
		return ((u64)count * (u64)ptimer_adp->tick_us);
	} else {
		ns2us = ((u64)count * (u64)ptimer_adp->tick_r_ns) / (u64)1000;
		return ((u64)count * (u64)ptimer_adp->tick_us + ns2us);
	}
}

/**
 *  @brief To read the counter and convert it as us unit.
 *
 *  @param[in] ptimer_adp The timer adapter.
 *
 *  @returns The counter value in us.
 */
SECTION_GTIMER_TEXT
u64 hal_rtl_timer_read_us64(phal_timer_adapter_t ptimer_adp)
{
	uint64_t count;
	uint64_t ns2us = 0;

	count = ((uint64_t)(ptimer_adp->overflow_fired) << 32) + (uint64_t)hal_rtl_timer_indir_read(ptimer_adp);
	if (ptimer_adp->tick_r_ns == 0) {
		return ((uint64_t)count * (uint64_t)ptimer_adp->tick_us);
	} else {
		ns2us = (count * (uint64_t)ptimer_adp->tick_r_ns) / (uint64_t)1000;
		return (((uint64_t)count * (uint64_t)ptimer_adp->tick_us) + ns2us);
	}
}


/**
 *  @brief To read the counter and convert it as ns unit.
 *
 *  @param[in] ptimer_adp The timer adapter.
 *
 *  @returns The counter value in ns.
 */
SECTION_GTIMER_TEXT
u64 hal_rtl_timer_read_ns(phal_timer_adapter_t ptimer_adp)
{
	u32 count;

//    count = hal_timer_read_rtl8195bhp (ptimer_adp);
	count = hal_rtl_timer_indir_read(ptimer_adp);
	if (ptimer_adp->tick_r_ns == 0) {
		return ((u64)count * (u64)ptimer_adp->tick_us * (u64)1000);
	} else {
		return (((u64)count * (u64)ptimer_adp->tick_us * (u64)1000) + ((u64)count * (u64)ptimer_adp->tick_r_ns));
	}
}

/**
 *  @brief To initial a HW timer as timer mode for application.
 *
 *  @param[in] ptimer_adp The timer adapter.
 *  @param[in] tid The timer ID(index).
 *
 *  @returns     HAL_OK:  Setting succeed.
 *  @returns     HAL_ERR_PARA:  Input arguments are invalid.
 */
SECTION_GTIMER_TEXT
hal_status_t hal_rtl_timer_init(phal_timer_adapter_t ptimer_adp, timer_id_t tid)
{
	hal_status_t ret;

	ret = hal_rtl_timer_bare_init(ptimer_adp, tid, 0);
	if (ret != HAL_OK) {
		return ret;
	}
	hal_rtl_timer_set_opmode(ptimer_adp, GTimerMode_Timer);
	hal_rtl_timer_set_cntmode(ptimer_adp, GTimerCountDown);
	//dbg_printf("3.25\r\n");

	return ret;
}

/**
 *  @brief To initial a HW timer as timer mode for application.
 *
 *  @param[in] ptimer_adp The timer adapter.
 *  @param[in] time_us The time period of timeout.
 *  @param[in] res_us The resolution of a tick time, in us.
 *                Value of 0 means didn't assign the tick resolution.
 *
 *  @returns The actual timeout value (us).
 */
SECTION_GTIMER_TEXT
u32 hal_rtl_timer_set_timeout(phal_timer_adapter_t ptimer_adp, u32 time_us, u32 res_us)
{
	u8 sclk_idx;
	u32 tick_cnt;
	u32 tick_ns;
	u32 min_tick_ns;
	u32 tick_res_ns;    // needed tick resolution
	u32 max_tick_ns;

	// Configure the pre-scaler
	sclk_idx = ptimer_adp->ptg_adp->sclk_idx;
//    min_tick_ns = (1000000000 / gtimer_sclk_freq[sclk_idx]);
	min_tick_ns = gtimer_min_tick[sclk_idx];
	max_tick_ns = gtimer_max_tick[sclk_idx];

//    tick_ns = min_tick_ns * 1000;   // maximum tick time (@ pre-scaler = 1000)
	if ((time_us <= 10) || ((time_us % 10) != 0)) {
		tick_res_ns = 1000;
	} else if ((time_us <= 100) || ((time_us % 100) != 0)) {
		tick_res_ns = 10000;
	} else if ((time_us <= 1000) || ((time_us % 1000) != 0)) {
		tick_res_ns = 100000;
	} else if ((time_us <= 10000) || ((time_us % 10000) != 0)) {
		tick_res_ns = 1000000;
	} else {
		tick_res_ns = 10000000;
	}
	// try to set the tick time which will count at least 2 ticks to timeout
	if (res_us == 0) {
		// didn't assign the resolution, give a bigger value
		res_us = time_us >> 1;
	}

	tick_ns = tick_res_ns;
	if (tick_ns > min_tick_ns) {
		uint32_t time_ns = time_us * 1000;
		uint32_t res_ns = res_us * 1000;

		while (((tick_ns << 1) > (time_ns)) ||
			   (tick_ns > (res_ns))) {
			// try smaller tick time
			tick_ns =  tick_ns >> 1;
			if (tick_ns <= min_tick_ns) {
				tick_ns = min_tick_ns;
				break;
			}
		}

		if (tick_ns > max_tick_ns) {
			tick_ns = max_tick_ns;
		}
	} else {
		tick_ns = min_tick_ns;
	}

//    dbg_printf("tick_ns %x\r\n", tick_ns);
	tick_ns = hal_rtl_timer_set_tick_time(ptimer_adp, (u32)tick_ns);  // Set prescale
	// set the counter reload
	tick_cnt = ((u64)time_us * 1000) / (ptimer_adp->tick_us * 1000 + ptimer_adp->tick_r_ns);

	if (ptimer_adp->tick_r_ns == 0) {
		while ((tick_cnt * ptimer_adp->tick_us) < time_us) {
			tick_cnt++;
		}
	} else {
		while (((tick_cnt * ptimer_adp->tick_us) + ((tick_cnt * ptimer_adp->tick_r_ns) / 1000)) < time_us) {
			tick_cnt++;
		}
	}
	if (tick_cnt > 0) {
		// timeout = tick_time * (reload_count + 1)
		tick_cnt--;
	}
	hal_rtl_timer_set_reload(ptimer_adp, tick_cnt);                    // Set Load Count
	tick_cnt++;
	if (ptimer_adp->tick_r_ns == 0) {
		return (tick_cnt * ptimer_adp->tick_us);
	} else {
		return ((tick_cnt * ptimer_adp->tick_us) + ((tick_cnt * ptimer_adp->tick_r_ns) / 1000));
	}
}

/**
 *  @brief To start an initialed timer.
 *
 *  @param[in] ptimer_adp The timer adapter.
 *  @param[in] reload_mode The timer counter reload mode, one shot or periodical.
 *
 *  @returns void
 */
SECTION_GTIMER_TEXT
void hal_rtl_timer_start(phal_timer_adapter_t ptimer_adp, timer_app_mode_t reload_mode)
{
	ptimer_adp->reload_mode = reload_mode;
	hal_rtl_timer_set_opmode(ptimer_adp, reload_mode);
	hal_rtl_timer_enable(ptimer_adp);
}

/**
 *  @brief To enable and setup a counter match event for a running timer.
 *         The function hal_rtl_timer_set_timeout() must be called
 *         befor calling of this function.
 *
 *  @param[in] ptimer_adp The timer adapter.
 *  @param[in] match_ev The match event number(0 ~ 3).
 *  @param[in] time_us The time period for the timer match event. This time period will be
 *                 converted to a tick count to set to the match event counter.
 *
 *  @returns     HAL_OK:  Setting succeed.
 *  @returns     HAL_ERR_PARA:  Input arguments are invalid.
 *  @returns     HAL_NOT_READY:  Error with data not ready.
 */
SECTION_GTIMER_TEXT
hal_status_t hal_rtl_timer_enable_match_event(phal_timer_adapter_t ptimer_adp, timer_match_event_t match_ev, u32 time_us)
{
	u32 tick_cnt;
	u32 reload_cnt;

	if (match_ev > GTimerMatchEvent3) {
		DBG_TIMER_ERR("hal_timer_enable_match_event: invalid event index(%u)!!\r\n", match_ev);
		return HAL_ERR_PARA;
	}

