swang-wyze/AmebaPro2_SDK_v9.0a/component/soc/8735b/fwlib/rtl8735b/lib/source/rom/rtl8735b_timer.c
	if ((ptimer_adp->tick_us == 0) && (ptimer_adp->tick_r_ns == 0)) {
		DBG_TIMER_ERR("hal_timer_enable_match_event: hal_timer_set_timeout must be called first!!\r\n");
		return HAL_NOT_READY;
	}

	//reload_cnt = ptimer_adp->tmr_ba->lc;
	reload_cnt = ptimer_adp->tmr_ba->TM_LC;

	// ptimer_adp->tick_us & ptimer_adp->tick_r_ns are calculated in hal_timer_set_timeout()
	tick_cnt = (time_us * 1000) / (ptimer_adp->tick_us * 1000 + ptimer_adp->tick_r_ns);
	if (reload_cnt <= tick_cnt) {
		DBG_TIMER_ERR("hal_timer_enable_match_event: match counter(%lu) > timeout counter(%lu)!!\r\n",
					  tick_cnt, reload_cnt);
		return HAL_ERR_PARA;
	}

	// since timer is using count-down mode, so tick count = reload ticks - time period ticks.
	//tick_cnt = ptimer_adp->tmr_ba->lc - tick_cnt;
	tick_cnt = ptimer_adp->tmr_ba->TM_LC - tick_cnt;
	hal_rtl_timer_set_me_counter(ptimer_adp, match_ev, tick_cnt);
	hal_rtl_timer_me_ctrl(ptimer_adp, match_ev, 1);
	return HAL_OK;
}

/**
 *  @brief To disable a counter match event.
 *
 *  @param[in] ptimer_adp The timer adapter.
 *  @param[in] match_ev The match event number(0 ~ 3).
 *
 *  @returns void
 */
SECTION_GTIMER_TEXT
void hal_rtl_timer_disable_match_event(phal_timer_adapter_t ptimer_adp, timer_match_event_t match_ev)
{
	if (match_ev > GTimerMatchEvent3) {
		return;
	}

	hal_rtl_timer_me_ctrl(ptimer_adp, match_ev, 0);
}

/**
 *  @brief To start an initialed timer with one shot mode.
 *
 *  @param[in] ptimer_adp The timer adapter.
 *  @param[in] time_us The time period of timeout.
 *  @param[in] callback The call back function for timeout event.
 *  @param[in] phid The argument for call back function calling.
 *
 *  @returns void
 */
SECTION_GTIMER_TEXT
void hal_rtl_timer_start_one_shot(phal_timer_adapter_t ptimer_adp, u32 time_us,
								  timer_callback_t callback, void *phid)
{
	// hook interrupt call back
	if (callback != (timer_callback_t)NULL) {
		hal_rtl_timer_reg_toirq(ptimer_adp, callback, phid);
		hal_rtl_timer_set_imr(ptimer_adp, 1);    // enable interrupt
	}
	hal_rtl_timer_set_timeout(ptimer_adp, time_us, 0);
	hal_rtl_timer_start(ptimer_adp, GTimerOneShot);
}

/**
 *  @brief To start an initialed timer with periodical mode.
 *
 *  @param[in] ptimer_adp The timer adapter.
 *  @param[in] time_us The time period of timeout.
 *  @param[in] callback The call back function for timeout event.
 *  @param[in] phid The argument for call back function calling.
 *
 *  @returns void
 */
SECTION_GTIMER_TEXT
void hal_rtl_timer_start_periodical(phal_timer_adapter_t ptimer_adp, u32 time_us,
									timer_callback_t callback, void *phid)
{
	// hook interrupt call back
	if (callback != (timer_callback_t)NULL) {
		hal_rtl_timer_reg_toirq(ptimer_adp, callback, phid);
		hal_rtl_timer_set_imr(ptimer_adp, 1);    // enable interrupt
	}
	hal_rtl_timer_set_timeout(ptimer_adp, time_us, 0);
	hal_rtl_timer_start(ptimer_adp, GTimerPeriodical);
}

/**
 *  @brief To allocate a free timer device.
 *
 *  @param[in] timer_list A list of timer ID, the caller limit the allocated timer
 *                    should be one of this list. The list should end with MaxGTimerNum.
 *                    If the list is NULL, then no limit to the timer allocation.
 *
 *  @returns The allocated timer ID. If allocation failed, it will return 0xFF.
 */
SECTION_GTIMER_TEXT
timer_id_t hal_rtl_timer_allocate(u8 *timer_list)
{
	timer_id_t i;
	timer_id_t tid = 0xFF;
	timer_id_t tg_tid;
	hal_timer_group_adapter_t *ptimer_group;

	if (timer_list == NULL) {
		ptimer_group = ptimer_group0;
		for (i = 0; i < MaxGTimerNum; i++) {
			if (i == GTIMER_GROUP_TIMER_NUM) {
				ptimer_group = ptimer_group2;
			}
			if ((ptimer_group->tmr_in_use & (1 << i)) == 0) {
				break;
			}
		}

		tid = i;
	} else {
		for (i = 0; i < MaxGTimerNum; i++) {
			tid = timer_list[i];
			if (tid > 8) {                      // For id > 9 TG2 allocate
				tid = tid - 1;
			}
			if (tid < MaxGTimerNum) {
				if (tid < GTIMER_GROUP_TIMER_NUM) {
					ptimer_group = ptimer_group0;
				} else {
					ptimer_group = ptimer_group2;
				}
				tg_tid = tid %  GTIMER_GROUP_TIMER_NUM;

				if ((ptimer_group->tmr_in_use & (1 << tg_tid)) == 0) {
					// found a free timer
					break;      // break the for loop
				}
			} else {
				// end of list
				break;
			}
		}
	}

	if (tid < MaxGTimerNum) {
		return tid;
	} else {
		return 0xFF;
	}
}

/**
 *  @brief To allocate and configure a timer to use as a tick source for PWM or ADC.
 *
 *  @param[in] ptimer_adp The timer adapter.
 *  @param[in] ptick_us Assign the tick time for the allocated timer should generate out.
 *         This pointer also be used to return the actual tick time (us).
 *  @param[in] timer_list The timer ID list. It should allocate a timer from this list.
 *
 *  @returns The allocated timer ID.
 */

SECTION_GTIMER_TEXT
timer_id_t hal_rtl_timer_event_init(phal_timer_adapter_t ptimer_adp, u32 *ptick_us, timer_id_t *timer_list)
{
	timer_id_t tid;
	hal_status_t ret;
	u32 act_tick_us;

	if (timer_list == NULL) {
		// no assign feverate timer, use default list
		timer_list = (timer_id_t *)pwm_avail_timer_list;
	}

	// Only the Timer Group1's timer can be used as the tick source of PWM
	tid = hal_rtl_timer_allocate(timer_list);

	if (tid >= GTIMER_GROUP_TIMER_NUM) {
		DBG_TIMER_ERR("hal_rtl_timer_event_init: no free timer\r\n");
		return 0xFF;    // PwmClkSrc_None
	}

	// Initial the G-timer as free run with the given tick time
	ret = hal_rtl_timer_init(ptimer_adp, tid);
	act_tick_us = hal_rtl_timer_set_timeout(ptimer_adp, *ptick_us, 0);
	hal_rtl_timer_set_imr(ptimer_adp, 0);    // disable interrupt

	ptimer_group0->timer_adapter[tid] = NULL;   // this timer adapter will not be save;

	if (ret == HAL_OK) {
		*ptick_us = act_tick_us;
		hal_rtl_timer_start(ptimer_adp, GTimerPeriodical);
	} else {
		return 0xFF;    // PwmClkSrc_None
	}

	return tid;
}

/**
 *  @brief To disable a HW timer which is used as the tick source for ADC or PWM.
 *
 *  @param[in] tid The timer index.
 *
 *  @returns void
 */
SECTION_GTIMER_TEXT
void hal_rtl_timer_event_deinit(timer_id_t tid)
{
	TM_TypeDef *TM_OBJ = (TM_TypeDef *)timer_base_address[tid];
	TM_OBJ->TM_CTRL = TM_OBJ->TM_CTRL & (~TM_BIT_EN);

	ptimer_group0->tmr_in_use &= ~(1 << (tid));

}

/** @} */ /* End of group hs_hal_timer_rom_func */
/// @endcond /* End of condition DOXYGEN_ROM_HAL_API */

/** @} */ /* End of group hs_hal_timer */

#endif  // end of "#if CONFIG_GTIMER_EN"

